# ðŸ¼ Pandas - Class 4: Data Selection & Filtering
Welcome to **Class 4** of our Pandas series. Today weâ€™ll explore techniques to select and filter data in a DataFrame.

## 1. Boolean Indexing & Conditional Selection
- Use comparison operators to build conditions (e.g., `df['col'] > 50`).
- Pass the condition inside `df[...]` to get matching rows.
- Combine multiple conditions with `&` (AND), `|` (OR), and `~` (NOT).
- Parentheses are required when combining conditions.

In [1]:
import pandas as pd
import numpy as np
a = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [25,28, 30, 35],
    "Score": [88,92,85,74]
}
b = pd.DataFrame(a)
b

      Name  Age  Score
0    Alice   25     88
1      Bob   28     92
2  Charlie   30     85
3    David   35     74

In [2]:
# Multiple condtions (AND): Age > 25 AND Score > 85
b[(b['Age'] > 25) & (b['Score'] > 85)]

  Name  Age  Score
1  Bob   28     92

In [3]:
# multiple conditons (or):Age < 25 or Score > 90
b[(b['Age'] < 25) | (b['Score'] > 90)]

  Name  Age  Score
1  Bob   28     92

In [4]:
# not
b[~(b['Age'] > 25)]

    Name  Age  Score
0  Alice   25     88

## 2. Filtering Rows with Multiple Conditions
- Combine two or more conditions to refine selection.
- Remember to enclose each condition in parentheses.

In [5]:
b[(b['Age'] > 25) & (b['Score'] > 85)]

  Name  Age  Score
1  Bob   28     92

## 3. Using `query()` for Cleaner Filtering
- `query()` allows filtering rows with a string expression.
- It's concise and readable for complex conditions.
- Variables can be passed using the `@` symbol.

In [6]:
# Simple query: Age > 25
b.query('Age > 25')

      Name  Age  Score
1      Bob   28     92
2  Charlie   30     85
3    David   35     74

In [7]:
# Multiple conditions: Age < 35 and score >= 85
b.query('Age < 35 and Score >= 85')

      Name  Age  Score
0    Alice   25     88
1      Bob   28     92
2  Charlie   30     85

In [8]:
# using a python  variable inside query(with @)
hold = 90
b.query('Score > @hold')

  Name  Age  Score
1  Bob   28     92

## 4. String Operations on Columns
- Use the `.str` accessor for vectorized string methods.
- Common methods: `contains`, `replace`, `startswith`, `endswith`, `lower`, `upper`.
- Useful for cleaning or filtering text data.

In [9]:
b

      Name  Age  Score
0    Alice   25     88
1      Bob   28     92
2  Charlie   30     85
3    David   35     74

In [10]:
b['Name'].str.lower()

0      alice
1        bob
2    charlie
3      david
Name: Name, dtype: object

In [11]:
b['Name'].str.upper()

0      ALICE
1        BOB
2    CHARLIE
3      DAVID
Name: Name, dtype: object

In [12]:
b[b['Name'].str.contains('a',case=False)]

      Name  Age  Score
0    Alice   25     88
2  Charlie   30     85
3    David   35     74

In [13]:
b['Name'].str.replace('a','@')

0      Alice
1        Bob
2    Ch@rlie
3      D@vid
Name: Name, dtype: object

In [14]:
b[b['Name'].str.startswith('A')]

    Name  Age  Score
0  Alice   25     88

In [15]:
b[b['Name'].str.endswith('e')]

      Name  Age  Score
0    Alice   25     88
2  Charlie   30     85

## Mini Practice
1. Build a DataFrame with columns such as Name, Age, City, Score.
2. Use boolean indexing to select rows where Age > 25.
3. Filter rows where City is either 'Delhi' or 'Mumbai'.
4. Use query() to find rows with Score >= 85 and Age < 35.
5. Clean a text column using str.replace or str.lower.

In [16]:


# 1. Build a DataFrame with columns: Name, Age, City, Score


# 2. Use boolean indexing to select rows where Age > 25
# Write your code here

# 3. Filter rows where City is either 'Delhi' or 'Mumbai'
# Write your code here

# 4. Use query() to find rows with Score >= 85 and Age < 35
# Write your code here

# 5. Clean a text column using str.replace or str.lower
# Example: convert City names to lowercase or replace "delhi" with "New Delhi"
# Write your code here

---
## Summary
- Learned to use boolean indexing and conditional selection.
- Filtered rows with multiple conditions.
- Used `query()` for clean filtering.
- Applied string operations with the `.str` accessor.